Testudoed/avr-cpp-lib/AVRCppLib/at90usb1287/IO.h
/**********************************************************************************************************************\

	C++ library for Atmel AVR microcontrollers
	Copyright (C) 2008 Lauri Kirikal, Mikk Leini, Rasmus Raag, MTU TTU Robotiklubi

	This program is free software; you can redistribute it and/or
	modify it under the terms of the GNU General Public License
	as published by the Free Software Foundation; either version 2
	of the License, or (at your option) any later version.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.

	You should have received a copy of the GNU General Public License
	along with this program; if not, write to the Free Software
	Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.

	See http://creativecommons.org/licenses/GPL/2.0/

	MTU TTU Robotiklubi  http://www.robotiklubi.ee robotiklubi@gmail.com
	Lauri Kirikal        laurikirikal@gmail.com
	Mikk Leini           mikk.leini@gmail.com
	Rasmus Raag          rasmus_raag@users.sourceforge.net

\**********************************************************************************************************************/

#ifndef __AVR_CPP_AT90USB1287_IO_H__
#define __AVR_CPP_AT90USB1287_IO_H__

#if defined(__DOXYGEN__) && !defined(__AVR_CPP_IO_H__)
#include <avr/cpp/IO.h>
#endif

#ifndef __AVR_CPP_IO_H__
#error "Include <avr/cpp/IO.h> instead of <avr/cpp/at90usb1287/IO.h>"
#else

#ifndef __AVR_CPP_XXX_IO_H__
#define __AVR_CPP_XXX_IO_H__
#else
#error "Attempt to include more than one <avr/cpp/XXX/IO.h> file"
#endif

/**********************************************************************************************************************\

	at90usb1287 registers, bits and ports declarations.
	This file is generated. Do not modify manually !!!

\**********************************************************************************************************************/

// Registers
namespace AVRCpp
{
	__DECLARE_8BIT_REGISTER__(OTGTCON);
	__DECLARE_8BIT_REGISTER__(UPINT);
	__DECLARE_8BIT_REGISTER__(UPBCHX);
	__DECLARE_8BIT_REGISTER__(UPBCLX);
	__DECLARE_8BIT_REGISTER__(UPERRX);
	__DECLARE_8BIT_REGISTER__(UEINT);
	__DECLARE_8BIT_REGISTER__(UEBCHX);
	__DECLARE_8BIT_REGISTER__(UEBCLX);
	__DECLARE_8BIT_REGISTER__(UEDATX);
	__DECLARE_8BIT_REGISTER__(UEIENX);
	__DECLARE_8BIT_REGISTER__(UESTA1X);
	__DECLARE_8BIT_REGISTER__(UESTA0X);
	__DECLARE_8BIT_REGISTER__(UECFG1X);
	__DECLARE_8BIT_REGISTER__(UECFG0X);
	__DECLARE_8BIT_REGISTER__(UECONX);
	__DECLARE_8BIT_REGISTER__(UERST);
	__DECLARE_8BIT_REGISTER__(UENUM);
	__DECLARE_8BIT_REGISTER__(UEINTX);
	__DECLARE_8BIT_REGISTER__(UDTST);
	__DECLARE_8BIT_REGISTER__(UDMFN);
	__DECLARE_8BIT_REGISTER__(UDFNUMH);
	__DECLARE_8BIT_REGISTER__(UDFNUML);
	__DECLARE_8BIT_REGISTER__(UDADDR);
	__DECLARE_8BIT_REGISTER__(UDIEN);
	__DECLARE_8BIT_REGISTER__(UDINT);
	__DECLARE_8BIT_REGISTER__(UDCON);
	__DECLARE_8BIT_REGISTER__(OTGINT);
	__DECLARE_8BIT_REGISTER__(OTGIEN);
	__DECLARE_8BIT_REGISTER__(OTGCON);
	__DECLARE_8BIT_REGISTER__(UDPADDH);
	__DECLARE_8BIT_REGISTER__(UDPADDL);
	__DECLARE_8BIT_REGISTER__(USBINT);
	__DECLARE_8BIT_REGISTER__(USBSTA);
	__DECLARE_8BIT_REGISTER__(USBCON);
	__DECLARE_8BIT_REGISTER__(UHWCON);
	__DECLARE_8BIT_REGISTER__(UDR1);
	__DECLARE_8BIT_REGISTER__(UBRR1H);
	__DECLARE_8BIT_REGISTER__(UBRR1L);
	__DECLARE_8BIT_REGISTER__(UCSR1C);
	__DECLARE_8BIT_REGISTER__(UCSR1B);
	__DECLARE_8BIT_REGISTER__(UCSR1A);
	__DECLARE_8BIT_REGISTER__(TWAMR);
	__DECLARE_8BIT_REGISTER__(TWCR);
	__DECLARE_8BIT_REGISTER__(TWDR);
	__DECLARE_8BIT_REGISTER__(TWAR);
	__DECLARE_8BIT_REGISTER__(TWSR);
	__DECLARE_8BIT_REGISTER__(TWBR);
	__DECLARE_8BIT_REGISTER__(ASSR);
	__DECLARE_8BIT_REGISTER__(OCR2B);
	__DECLARE_8BIT_REGISTER__(OCR2A);
	__DECLARE_8BIT_REGISTER__(TCNT2);
	__DECLARE_8BIT_REGISTER__(TCCR2B);
	__DECLARE_8BIT_REGISTER__(TCCR2A);
	__DECLARE_8BIT_REGISTER__(UPDATX);
	__DECLARE_8BIT_REGISTER__(UPIENX);
	__DECLARE_8BIT_REGISTER__(UPCFG2X);
	__DECLARE_8BIT_REGISTER__(UPSTAX);
	__DECLARE_8BIT_REGISTER__(UPCFG1X);
	__DECLARE_8BIT_REGISTER__(UPCFG0X);
	__DECLARE_8BIT_REGISTER__(UPCONX);
	__DECLARE_8BIT_REGISTER__(UPRST);
	__DECLARE_8BIT_REGISTER__(UPNUM);
	__DECLARE_8BIT_REGISTER__(UPINTX);
	__DECLARE_8BIT_REGISTER__(UPINRQX);
	__DECLARE_8BIT_REGISTER__(UHFLEN);
	__DECLARE_8BIT_REGISTER__(UHFNUMH);
	__DECLARE_8BIT_REGISTER__(UHFNUML);
	__DECLARE_8BIT_REGISTER__(UHADDR);
	__DECLARE_8BIT_REGISTER__(UHIEN);
	__DECLARE_8BIT_REGISTER__(UHINT);
	__DECLARE_8BIT_REGISTER__(UHCON);
	__DECLARE_8BIT_REGISTER__(OCR3CH);
	__DECLARE_8BIT_REGISTER__(OCR3CL);
	__DECLARE_8BIT_REGISTER__(OCR3BH);
	__DECLARE_8BIT_REGISTER__(OCR3BL);
	__DECLARE_8BIT_REGISTER__(OCR3AH);
	__DECLARE_8BIT_REGISTER__(OCR3AL);
	__DECLARE_8BIT_REGISTER__(ICR3H);
	__DECLARE_8BIT_REGISTER__(ICR3L);
	__DECLARE_8BIT_REGISTER__(TCNT3H);
	__DECLARE_8BIT_REGISTER__(TCNT3L);
	__DECLARE_8BIT_REGISTER__(TCCR3C);
	__DECLARE_8BIT_REGISTER__(TCCR3B);
	__DECLARE_8BIT_REGISTER__(TCCR3A);
	__DECLARE_8BIT_REGISTER__(OCR1CH);
	__DECLARE_8BIT_REGISTER__(OCR1CL);
	__DECLARE_8BIT_REGISTER__(OCR1BH);
	__DECLARE_8BIT_REGISTER__(OCR1BL);
	__DECLARE_8BIT_REGISTER__(OCR1AH);
	__DECLARE_8BIT_REGISTER__(OCR1AL);
	__DECLARE_8BIT_REGISTER__(ICR1H);
	__DECLARE_8BIT_REGISTER__(ICR1L);
	__DECLARE_8BIT_REGISTER__(TCNT1H);
	__DECLARE_8BIT_REGISTER__(TCNT1L);
	__DECLARE_8BIT_REGISTER__(TCCR1C);
	__DECLARE_8BIT_REGISTER__(TCCR1B);
	__DECLARE_8BIT_REGISTER__(TCCR1A);
	__DECLARE_8BIT_REGISTER__(DIDR1);
	__DECLARE_8BIT_REGISTER__(DIDR0);
	__DECLARE_8BIT_REGISTER__(ADMUX);
	__DECLARE_8BIT_REGISTER__(ADCSRB);
	__DECLARE_8BIT_REGISTER__(ADCSRA);
	__DECLARE_8BIT_REGISTER__(ADCH);
	__DECLARE_8BIT_REGISTER__(ADCL);
	__DECLARE_8BIT_REGISTER__(XMCRB);
	__DECLARE_8BIT_REGISTER__(XMCRA);
	__DECLARE_8BIT_REGISTER__(TIMSK3);
	__DECLARE_8BIT_REGISTER__(TIMSK2);
	__DECLARE_8BIT_REGISTER__(TIMSK1);
	__DECLARE_8BIT_REGISTER__(TIMSK0);
	__DECLARE_8BIT_REGISTER__(PCMSK0);
	__DECLARE_8BIT_REGISTER__(EICRB);
	__DECLARE_8BIT_REGISTER__(EICRA);
	__DECLARE_8BIT_REGISTER__(PCICR);
	__DECLARE_8BIT_REGISTER__(OSCCAL);
	__DECLARE_8BIT_REGISTER__(PRR1);
	__DECLARE_8BIT_REGISTER__(PRR0);
	__DECLARE_8BIT_REGISTER__(CLKPR);
	__DECLARE_8BIT_REGISTER__(WDTCSR);
	__DECLARE_8BIT_REGISTER__(SREG);
	__DECLARE_8BIT_REGISTER__(SPH);
	__DECLARE_8BIT_REGISTER__(SPL);
	__DECLARE_8BIT_REGISTER__(RAMPZ);
	__DECLARE_8BIT_REGISTER__(SPMCSR);
	__DECLARE_8BIT_REGISTER__(MCUCR);
	__DECLARE_8BIT_REGISTER__(MCUSR);
	__DECLARE_8BIT_REGISTER__(SMCR);
	__DECLARE_8BIT_REGISTER__(OCDR);
	__DECLARE_8BIT_REGISTER__(MONDR);
	__DECLARE_8BIT_REGISTER__(ACSR);
	__DECLARE_8BIT_REGISTER__(SPDR);
	__DECLARE_8BIT_REGISTER__(SPSR);
	__DECLARE_8BIT_REGISTER__(SPCR);
	__DECLARE_8BIT_REGISTER__(GPIOR2);
	__DECLARE_8BIT_REGISTER__(GPIOR1);
	__DECLARE_8BIT_REGISTER__(PLLCSR);
	__DECLARE_8BIT_REGISTER__(OCR0B);
	__DECLARE_8BIT_REGISTER__(OCR0A);
	__DECLARE_8BIT_REGISTER__(TCNT0);
	__DECLARE_8BIT_REGISTER__(TCCR0B);
	__DECLARE_8BIT_REGISTER__(TCCR0A);
	__DECLARE_8BIT_REGISTER__(GTCCR);
	__DECLARE_8BIT_REGISTER__(EEARH);
	__DECLARE_8BIT_REGISTER__(EEARL);
	__DECLARE_8BIT_REGISTER__(EEDR);
	__DECLARE_8BIT_REGISTER__(EECR);
	__DECLARE_8BIT_REGISTER__(GPIOR0);
	__DECLARE_8BIT_REGISTER__(EIMSK);
	__DECLARE_8BIT_REGISTER__(EIFR);
	__DECLARE_8BIT_REGISTER__(PCIFR);
	__DECLARE_8BIT_REGISTER__(TIFR3);
	__DECLARE_8BIT_REGISTER__(TIFR2);
	__DECLARE_8BIT_REGISTER__(TIFR1);
	__DECLARE_8BIT_REGISTER__(TIFR0);
	__DECLARE_8BIT_REGISTER__(PORTF);
	__DECLARE_8BIT_REGISTER__(DDRF);
	__DECLARE_8BIT_REGISTER__(PINF);
	__DECLARE_8BIT_REGISTER__(PORTE);
	__DECLARE_8BIT_REGISTER__(DDRE);
	__DECLARE_8BIT_REGISTER__(PINE);
	__DECLARE_8BIT_REGISTER__(PORTD);
	__DECLARE_8BIT_REGISTER__(DDRD);
	__DECLARE_8BIT_REGISTER__(PIND);
	__DECLARE_8BIT_REGISTER__(PORTC);
	__DECLARE_8BIT_REGISTER__(DDRC);
	__DECLARE_8BIT_REGISTER__(PINC);
	__DECLARE_8BIT_REGISTER__(PORTB);
	__DECLARE_8BIT_REGISTER__(DDRB);
	__DECLARE_8BIT_REGISTER__(PINB);
	__DECLARE_8BIT_REGISTER__(PORTA);
	__DECLARE_8BIT_REGISTER__(DDRA);
	__DECLARE_8BIT_REGISTER__(PINA);
	__DECLARE_16BIT_REGISTER__(OCR3C);
	__DECLARE_16BIT_REGISTER__(OCR3B);
	__DECLARE_16BIT_REGISTER__(OCR3A);
	__DECLARE_16BIT_REGISTER__(ICR3);
	__DECLARE_16BIT_REGISTER__(TCNT3);
	__DECLARE_16BIT_REGISTER__(OCR1C);
	__DECLARE_16BIT_REGISTER__(OCR1B);
	__DECLARE_16BIT_REGISTER__(OCR1A);
	__DECLARE_16BIT_REGISTER__(ICR1);
	__DECLARE_16BIT_REGISTER__(TCNT1);
	__DECLARE_16BIT_REGISTER__(ADC);
	__DECLARE_16BIT_REGISTER__(SP);
	__DECLARE_16BIT_REGISTER__(UDFNUM);
	__DECLARE_16BIT_REGISTER__(UDPADD);
	__DECLARE_16BIT_REGISTER__(UHFNUM);

} // namespace AVRCpp


// OTGTCON
#define _PAGE1 0x40
#define _PAGE0 0x20
#define _VALUE1 0x2
#define _VALUE0 0x1

