Testudoed/avr-cpp-lib/AVRCppLib/at90usb1287/IO.h
// UHFLEN
#define _FLEN7 0x80
#define _FLEN6 0x40
#define _FLEN5 0x20
#define _FLEN4 0x10
#define _FLEN3 0x8
#define _FLEN2 0x4
#define _FLEN1 0x2
#define _FLEN0 0x1

// UHADDR
#define _HADD6 0x40
#define _HADD5 0x20
#define _HADD4 0x10
#define _HADD3 0x8
#define _HADD2 0x4
#define _HADD1 0x2
#define _HADD0 0x1

// UHIEN
#define _UPRSME 0x40
#define _EORSME 0x20
#define _WAKEUPE 0x10
#define _EORSTE 0x8
#define _SOFE 0x4
#define _MSOFE 0x2
#define _SUSPE 0x1

// UHINT
#define _HWUPI 0x40
#define _HSOFI 0x20
#define _RXRSMI 0x10
#define _RSMEDI 0x8
#define _RSTI 0x4
#define _DDISCI 0x2
#define _DCONNI 0x1

// UHCON
#define _RESUME 0x4
#define _RESET 0x2
#define _SOFEN 0x1

// TCCR3C
#define _FOC3A 0x80
#define _FOC3B 0x40
#define _FOC3C 0x20

// TCCR3B
#define _ICNC3 0x80
#define _ICES3 0x40
#define _WGM33 0x10
#define _WGM32 0x8
#define _CS32 0x4
#define _CS31 0x2
#define _CS30 0x1

// TCCR3A
#define _COM3A1 0x80
#define _COM3A0 0x40
#define _COM3B1 0x20
#define _COM3B0 0x10
#define _COM3C1 0x8
#define _COM3C0 0x4
#define _WGM31 0x2
#define _WGM30 0x1

// TCCR1C
#define _FOC1A 0x80
#define _FOC1B 0x40
#define _FOC1C 0x20

// TCCR1B
#define _ICNC1 0x80
#define _ICES1 0x40
#define _WGM13 0x10
#define _WGM12 0x8
#define _CS12 0x4
#define _CS11 0x2
#define _CS10 0x1

// TCCR1A
#define _COM1A1 0x80
#define _COM1A0 0x40
#define _COM1B1 0x20
#define _COM1B0 0x10
#define _COM1C1 0x8
#define _COM1C0 0x4
#define _WGM11 0x2
#define _WGM10 0x1

// DIDR1
#define _AIN1D 0x2
#define _AIN0D 0x1

// DIDR0
#define _ADC7D 0x80
#define _ADC6D 0x40
#define _ADC5D 0x20
#define _ADC4D 0x10
#define _ADC3D 0x8
#define _ADC2D 0x4
#define _ADC1D 0x2
#define _ADC0D 0x1

// ADMUX
#define _REFS1 0x80
#define _REFS0 0x40
#define _ADLAR 0x20
#define _MUX4 0x10
#define _MUX3 0x8
#define _MUX2 0x4
#define _MUX1 0x2
#define _MUX0 0x1

// ADCSRB
#define _ADHSM 0x80
#define _ACME 0x40
#define _MUX5 0x8
#define _ADTS2 0x4
#define _ADTS1 0x2
#define _ADTS0 0x1

// ADCSRA
#define _ADEN 0x80
#define _ADSC 0x40
#define _ADATE 0x20
#define _ADIF 0x10
#define _ADIE 0x8
#define _ADPS2 0x4
#define _ADPS1 0x2
#define _ADPS0 0x1

// XMCRB
#define _XMBK 0x80
#define _XMM2 0x4
#define _XMM1 0x2
#define _XMM0 0x1

// XMCRA
#define _SRE 0x80
#define _SRL2 0x40
#define _SRL1 0x20
#define _SRL0 0x10
#define _SRW11 0x8
#define _SRW10 0x4
#define _SRW01 0x2
#define _SRW00 0x1

// TIMSK3
#define _ICIE3 0x20
#define _OCIE3C 0x8
#define _OCIE3B 0x4
#define _OCIE3A 0x2
#define _TOIE3 0x1

// TIMSK2
#define _OCIE2B 0x4
#define _OCIE2A 0x2
#define _TOIE2 0x1

// TIMSK1
#define _ICIE1 0x20
#define _OCIE1C 0x8
#define _OCIE1B 0x4
#define _OCIE1A 0x2
#define _TOIE1 0x1

// TIMSK0
#define _OCIE0B 0x4
#define _OCIE0A 0x2
#define _TOIE0 0x1

// PCMSK0
#define _PCINT7 0x80
#define _PCINT6 0x40
#define _PCINT5 0x20
#define _PCINT4 0x10
#define _PCINT3 0x8
#define _PCINT2 0x4
#define _PCINT1 0x2
#define _PCINT0 0x1

// EICRB
#define _ISC71 0x80
#define _ISC70 0x40
#define _ISC61 0x20
#define _ISC60 0x10
#define _ISC51 0x8
#define _ISC50 0x4
#define _ISC41 0x2
#define _ISC40 0x1

// EICRA
#define _ISC31 0x80
#define _ISC30 0x40
#define _ISC21 0x20
#define _ISC20 0x10
#define _ISC11 0x8
#define _ISC10 0x4
#define _ISC01 0x2
#define _ISC00 0x1

// PCICR
#define _PCIE0 0x1

// PRR1
#define _PRUSB 0x80
#define _PRTIM3 0x8
#define _PRUSART1 0x1

// PRR0
#define _PRTWI 0x80
#define _PRTIM2 0x40
#define _PRTIM0 0x20
#define _PRTIM1 0x8
#define _PRSPI 0x4
#define _PRADC 0x1

// CLKPR
#define _CLKPCE 0x80
#define _CLKPS3 0x8
#define _CLKPS2 0x4
#define _CLKPS1 0x2
#define _CLKPS0 0x1

// WDTCSR
#define _WDIF 0x80
#define _WDIE 0x40
#define _WDP3 0x20
#define _WDCE 0x10
#define _WDE 0x8
#define _WDP2 0x4
#define _WDP1 0x2
#define _WDP0 0x1

// SREG
#define _SREG_I 0x80
#define _SREG_T 0x40
#define _SREG_H 0x20
#define _SREG_S 0x10
#define _SREG_V 0x8
#define _SREG_N 0x4
#define _SREG_Z 0x2
#define _SREG_C 0x1

// SPH
#define _SP15 0x80
#define _SP14 0x40
#define _SP13 0x20
#define _SP12 0x10
#define _SP11 0x8
#define _SP10 0x4
#define _SP9 0x2
#define _SP8 0x1

// SPL
#define _SP7 0x80
#define _SP6 0x40
#define _SP5 0x20
#define _SP4 0x10
#define _SP3 0x8
#define _SP2 0x4
#define _SP1 0x2
#define _SP0 0x1

// RAMPZ
#define _RAMPZ1 0x2
#define _RAMPZ0 0x1

// SPMCSR
#define _SPMIE 0x80
#define _RWWSB 0x40
#define _SIGRD 0x20
#define _RWWSRE 0x10
#define _BLBSET 0x8
#define _PGWRT 0x4
#define _PGERS 0x2
#define _SPMEN 0x1

// MCUCR
#define _JTD 0x80
#define _PUD 0x10
#define _IVSEL 0x2
#define _IVCE 0x1

// MCUSR
#define _JTRF 0x10
#define _WDRF 0x8
#define _BORF 0x4
#define _EXTRF 0x2
#define _PORF 0x1

// SMCR
#define _SM2 0x8
#define _SM1 0x4
#define _SM0 0x2
#define _SE 0x1

// OCDR
#define _OCDR7 0x80
#define _OCDR6 0x40
#define _OCDR5 0x20
#define _OCDR4 0x10
#define _OCDR3 0x8
#define _OCDR2 0x4
#define _OCDR1 0x2
#define _OCDR0 0x1

// ACSR
#define _ACD 0x80
#define _ACBG 0x40
#define _ACO 0x20
#define _ACI 0x10
#define _ACIE 0x8
#define _ACIC 0x4
#define _ACIS1 0x2
#define _ACIS0 0x1

// SPSR
#define _SPIF 0x80
#define _WCOL 0x40
#define _SPI2X 0x1

// SPCR
#define _SPIE 0x80
#define _SPE 0x40
#define _DORD 0x20
#define _MSTR 0x10
#define _CPOL 0x8
#define _CPHA 0x4
#define _SPR1 0x2
#define _SPR0 0x1

// PLLCSR
#define _PLLP2 0x10
#define _PLLP1 0x8
#define _PLLP0 0x4
#define _PLLE 0x2
#define _PLOCK 0x1

// TCCR0B
#define _FOC0A 0x80
#define _FOC0B 0x40
#define _WGM02 0x8
#define _CS02 0x4
#define _CS01 0x2
#define _CS00 0x1

// TCCR0A
#define _COM0A1 0x80
#define _COM0A0 0x40
#define _COM0B1 0x20
#define _COM0B0 0x10
#define _WGM01 0x2
#define _WGM00 0x1

// GTCCR
#define _TSM 0x80
#define _PSRASY 0x2
#define _PSRSYNC 0x1

// EECR
#define _EEPM1 0x20
#define _EEPM0 0x10
#define _EERIE 0x8
#define _EEMPE 0x4
#define _EEPE 0x2
#define _EERE 0x1

// EIMSK
#define _INT7 0x80
#define _INT6 0x40
#define _INT5 0x20
#define _INT4 0x10
#define _INT3 0x8
#define _INT2 0x4
#define _INT1 0x2
#define _INT0 0x1

// EIFR
#define _INTF7 0x80
#define _INTF6 0x40
#define _INTF5 0x20
#define _INTF4 0x10
#define _INTF3 0x8
#define _INTF2 0x4
#define _INTF1 0x2
#define _INTF0 0x1

