Testudoed/avr-cpp-lib/AVRCppLib/at90usb1287/IO.h
// PCIFR
#define _PCIF0 0x1

// TIFR3
#define _ICF3 0x20
#define _OCF3C 0x8
#define _OCF3B 0x4
#define _OCF3A 0x2
#define _TOV3 0x1

// TIFR2
#define _OCF2B 0x4
#define _OCF2A 0x2
#define _TOV2 0x1

// TIFR1
#define _ICF1 0x20
#define _OCF1C 0x8
#define _OCF1B 0x4
#define _OCF1A 0x2
#define _TOV1 0x1

// TIFR0
#define _OCF0B 0x4
#define _OCF0A 0x2
#define _TOV0 0x1

// PORTF
#define _PF7 0x80
#define _PF6 0x40
#define _PF5 0x20
#define _PF4 0x10
#define _PF3 0x8
#define _PF2 0x4
#define _PF1 0x2
#define _PF0 0x1

// DDRF
#define _DDF7 0x80
#define _DDF6 0x40
#define _DDF5 0x20
#define _DDF4 0x10
#define _DDF3 0x8
#define _DDF2 0x4
#define _DDF1 0x2
#define _DDF0 0x1

// PINF
#define _PINF7 0x80
#define _PINF6 0x40
#define _PINF5 0x20
#define _PINF4 0x10
#define _PINF3 0x8
#define _PINF2 0x4
#define _PINF1 0x2
#define _PINF0 0x1

// PORTE
#define _PE7 0x80
#define _PE6 0x40
#define _PE5 0x20
#define _PE4 0x10
#define _PE3 0x8
#define _PE2 0x4
#define _PE1 0x2
#define _PE0 0x1

// DDRE
#define _DDE7 0x80
#define _DDE6 0x40
#define _DDE5 0x20
#define _DDE4 0x10
#define _DDE3 0x8
#define _DDE2 0x4
#define _DDE1 0x2
#define _DDE0 0x1

// PINE
#define _PINE7 0x80
#define _PINE6 0x40
#define _PINE5 0x20
#define _PINE4 0x10
#define _PINE3 0x8
#define _PINE2 0x4
#define _PINE1 0x2
#define _PINE0 0x1

// PORTD
#define _PD7 0x80
#define _PD6 0x40
#define _PD5 0x20
#define _PD4 0x10
#define _PD3 0x8
#define _PD2 0x4
#define _PD1 0x2
#define _PD0 0x1

// DDRD
#define _DDD7 0x80
#define _DDD6 0x40
#define _DDD5 0x20
#define _DDD4 0x10
#define _DDD3 0x8
#define _DDD2 0x4
#define _DDD1 0x2
#define _DDD0 0x1

// PIND
#define _PIND7 0x80
#define _PIND6 0x40
#define _PIND5 0x20
#define _PIND4 0x10
#define _PIND3 0x8
#define _PIND2 0x4
#define _PIND1 0x2
#define _PIND0 0x1

// PORTC
#define _PC7 0x80
#define _PC6 0x40
#define _PC5 0x20
#define _PC4 0x10
#define _PC3 0x8
#define _PC2 0x4
#define _PC1 0x2
#define _PC0 0x1

// DDRC
#define _DDC7 0x80
#define _DDC6 0x40
#define _DDC5 0x20
#define _DDC4 0x10
#define _DDC3 0x8
#define _DDC2 0x4
#define _DDC1 0x2
#define _DDC0 0x1

// PINC
#define _PINC7 0x80
#define _PINC6 0x40
#define _PINC5 0x20
#define _PINC4 0x10
#define _PINC3 0x8
#define _PINC2 0x4
#define _PINC1 0x2
#define _PINC0 0x1

// PORTB
#define _PB7 0x80
#define _PB6 0x40
#define _PB5 0x20
#define _PB4 0x10
#define _PB3 0x8
#define _PB2 0x4
#define _PB1 0x2
#define _PB0 0x1

// DDRB
#define _DDB7 0x80
#define _DDB6 0x40
#define _DDB5 0x20
#define _DDB4 0x10
#define _DDB3 0x8
#define _DDB2 0x4
#define _DDB1 0x2
#define _DDB0 0x1

// PINB
#define _PINB7 0x80
#define _PINB6 0x40
#define _PINB5 0x20
#define _PINB4 0x10
#define _PINB3 0x8
#define _PINB2 0x4
#define _PINB1 0x2
#define _PINB0 0x1

// PORTA
#define _PA7 0x80
#define _PA6 0x40
#define _PA5 0x20
#define _PA4 0x10
#define _PA3 0x8
#define _PA2 0x4
#define _PA1 0x2
#define _PA0 0x1

// DDRA
#define _DDA7 0x80
#define _DDA6 0x40
#define _DDA5 0x20
#define _DDA4 0x10
#define _DDA3 0x8
#define _DDA2 0x4
#define _DDA1 0x2
#define _DDA0 0x1

// PINA
#define _PINA7 0x80
#define _PINA6 0x40
#define _PINA5 0x20
#define _PINA4 0x10
#define _PINA3 0x8
#define _PINA2 0x4
#define _PINA1 0x2
#define _PINA0 0x1


// General ports
namespace AVRCpp
{
	__DECLARE_PORT__(F);
	__DECLARE_PORT__(E);
	__DECLARE_PORT__(D);
	__DECLARE_PORT__(C);
	__DECLARE_PORT__(B);
	__DECLARE_PORT__(A);
	
} // namespace AVRCpp


/**********************************************************************************************************************/

#endif // ifndef __AVR_CPP_IO_H__
#endif // ifndef __AVR_CPP_AT90USB1287_IO_H__
